DataProcessors/ТестированиеВебСервера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>ТестированиеВебСервера</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоПотоков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОбращений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресHTTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресOData</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СтатистикаОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаОбращений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПериодВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КоличествоОбъектов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ТестированиеВебСервера/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьНастройуиПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройуиПоУмолчанию()
	
	ОбъектТестирования = 0;
	Объект.АдресHTTP = "http://82.202.253.117/RA_DO_DEV2/hs/exchange/Document_Nesootvetstvie";
	Объект.АдресOData = "http://82.202.253.117/RA_DO_DEV2/odata/standard.odata/Document_%D1%80%D0%B0_%D0%9D%D0%B5%D1%81%D0%BE%D0%BE%D1%82%D0%B2%D0%B5%D1%82%D1%81%D1%82%D0%B2%D0%B8%D0%B5";
	Объект.КоличествоПотоков = 20;
	Объект.КоличествоОбращений = 200;
	
	ЗаполнитьТаблицуКоличествоОбъектовВВыборке();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуКоличествоОбъектовВВыборке()
	
	КоличествоОбъектовВВыборке.Добавить().КоличествоОбъектов = 50;
	КоличествоОбъектовВВыборке.Добавить().КоличествоОбъектов = 150;
	КоличествоОбъектовВВыборке.Добавить().КоличествоОбъектов = 1000;
	КоличествоОбъектовВВыборке.Добавить().КоличествоОбъектов = 3000;
	
	КоличествоОбъектовВыделитьВсе("");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	
	ВыполнитьЗапросНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗапросНаСервере()
	
	ОчиститьСтатистику();
	
	ПараметрыТестирования = Новый Структура;
	ПараметрыТестирования.Вставить("ОбъектТестирования", ОбъектТестирования);
	ПараметрыТестирования.Вставить("АдресHTTP", Объект.АдресHTTP);
	ПараметрыТестирования.Вставить("АдресOData", Объект.АдресOData);
	ПараметрыТестирования.Вставить("КоличествоОбращений", Объект.КоличествоОбращений);
	
	МассивКоличествоОбъектов = Новый Массив;
	
	Для Каждого СтрокаТЗ ИЗ КоличествоОбъектовВВыборке Цикл
		
		Если НЕ СтрокаТЗ.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		МассивКоличествоОбъектов.Добавить(СтрокаТЗ.КоличествоОбъектов);
		
	КонецЦикла;
			
	ПараметрыТестирования.Вставить("МассивКоличествоОбъектов", МассивКоличествоОбъектов);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ПараметрыТестирования);
	
	Для СчетчикПотоков = 1 По Объект.КоличествоПотоков Цикл
		МассивПараметров[0].Вставить("НомерПотока", СчетчикПотоков);
		Задание = ФоновыеЗадания.Выполнить("ТестированиеВебСервера.ВыполнитьОбращениеКВебСерверу", МассивПараметров);
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьСтатистику()
	
	НЗ = РегистрыСведений.СтатистикаОбращений.СоздатьНаборЗаписей();
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоОбъектовВыделитьВсе(Команда)
	
	Для Каждого СтрокаТЗ ИЗ КоличествоОбъектовВВыборке Цикл
		СтрокаТЗ.Использование = Истина;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура КоличествоОбъектовСнятьВсе(Команда)
	
	Для Каждого СтрокаТЗ ИЗ КоличествоОбъектовВВыборке Цикл
		СтрокаТЗ.Использование = Ложь;
	КонецЦикла;
	
КонецПроцедуры
